-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Mike\Documents\GitHub\stata-binscatter2\check_speed.log
  log type:  text
 opened on:  14 Feb 2019, 01:43:40
r; t=0.00 1:43:40

. 
. *-------------------------------------------------------------------------------
. * Setup options
. *-------------------------------------------------------------------------------
. 
. local num_sims 6
r; t=0.00 1:43:40

. local num_bins 10
r; t=0.00 1:43:40

. 
. local sim_1_size 1000000
r; t=0.00 1:43:40

. local sim_1_reps 100
r; t=0.00 1:43:40

. 
. local sim_2_size 10000000
r; t=0.00 1:43:40

. local sim_2_reps 50
r; t=0.00 1:43:40

. 
. local sim_3_size 25000000
r; t=0.00 1:43:40

. local sim_3_reps 25
r; t=0.00 1:43:40

. 
. local sim_4_size 50000000
r; t=0.00 1:43:40

. local sim_4_reps 20
r; t=0.00 1:43:40

. 
. local sim_5_size 100000000
r; t=0.00 1:43:40

. local sim_5_reps 5
r; t=0.00 1:43:40

. 
. local sim_6_size 500000000
r; t=0.00 1:43:40

. local sim_6_reps 5
r; t=0.00 1:43:40

. 
. *-------------------------------------------------------------------------------
. * Initialization
. *-------------------------------------------------------------------------------
. 
. * Cheap fix: define `sizes' and `num_sims'
. local max_reps 0
r; t=0.00 1:43:40

. forval i=1/`num_sims' {
  2.         local sizes `sizes' `sims_`i'_size'
  3.         if `sim_`i'_reps' > `max_reps' local max_reps = `sim_`i'_reps'
  4. }
r; t=0.00 1:43:40

. 
. * Create matrices to store results
. set matsize 10000
r; t=0.00 1:43:40

. mat results_old = J(`max_reps',`num_sims',.) 
r; t=0.00 1:43:40

. mat results_new = J(`max_reps',`num_sims',.) 
r; t=0.00 1:43:40

. 
. *-------------------------------------------------------------------------------
. * Monte Carlo tests
. *-------------------------------------------------------------------------------
. 
. * Cheap fix: define `sizes' and `num_sims'
. forval i=1/`num_sims' {
  2.         local sizes `sizes' `sim_`i'_size'
  3. }
r; t=0.00 1:43:40

. 
. local col = 0
r; t=0.00 1:43:40

. forval i=1/`num_sims' {
  2.         local curr_reps = `sim_`i'_reps'
  3.         local curr_size = `sim_`i'_size'
  4.         local col = `col' + 1
  5.         noi di "sim `i' (reps: `curr_reps')"
  6.         
.         * Run Monte Carlo simulations
.         qui forval j=1/`curr_reps' {
  7.                 noi di "  rep `j' of `curr_reps'"
  8.                 
.                 * Generate data
.                 clear
  9.                 set obs `curr_size'
 10.                 gen x = runiform()
 11.                 gen y = 1 + 2*x + 3*x^2 + 4*x^3 + rnormal()*5*x
 12.                 
.                 * Test binscatter
.                 timer on 1
 13.                 qui binscatter y x, nq(`num_bins')
 14.                 timer off 1
 15.                 
.                 
.                 * Test binscatter2
.                 timer on 2
 16.                 qui binscatter2 y x, nq(`num_bins')
 17.                 timer off 2
 18.                 
.                 * Save results
.                 timer list
 19.                 mat results_old[`j',`col'] = r(t1)
 20.                 mat results_new[`j',`col'] = r(t2)
 21.                 timer clear
 22.                 
.         }
 23. }
sim 1 (reps: 100)
  rep 1 of 100
  rep 2 of 100
  rep 3 of 100
  rep 4 of 100
  rep 5 of 100
  rep 6 of 100
  rep 7 of 100
  rep 8 of 100
  rep 9 of 100
  rep 10 of 100
  rep 11 of 100
  rep 12 of 100
  rep 13 of 100
  rep 14 of 100
  rep 15 of 100
  rep 16 of 100
  rep 17 of 100
  rep 18 of 100
  rep 19 of 100
  rep 20 of 100
  rep 21 of 100
  rep 22 of 100
  rep 23 of 100
  rep 24 of 100
  rep 25 of 100
  rep 26 of 100
  rep 27 of 100
  rep 28 of 100
  rep 29 of 100
  rep 30 of 100
  rep 31 of 100
  rep 32 of 100
  rep 33 of 100
  rep 34 of 100
  rep 35 of 100
  rep 36 of 100
  rep 37 of 100
  rep 38 of 100
  rep 39 of 100
  rep 40 of 100
  rep 41 of 100
  rep 42 of 100
  rep 43 of 100
  rep 44 of 100
  rep 45 of 100
  rep 46 of 100
  rep 47 of 100
  rep 48 of 100
  rep 49 of 100
  rep 50 of 100
  rep 51 of 100
  rep 52 of 100
  rep 53 of 100
  rep 54 of 100
  rep 55 of 100
  rep 56 of 100
  rep 57 of 100
  rep 58 of 100
  rep 59 of 100
  rep 60 of 100
  rep 61 of 100
  rep 62 of 100
  rep 63 of 100
  rep 64 of 100
  rep 65 of 100
  rep 66 of 100
  rep 67 of 100
  rep 68 of 100
  rep 69 of 100
  rep 70 of 100
  rep 71 of 100
  rep 72 of 100
  rep 73 of 100
  rep 74 of 100
  rep 75 of 100
  rep 76 of 100
  rep 77 of 100
  rep 78 of 100
  rep 79 of 100
  rep 80 of 100
  rep 81 of 100
  rep 82 of 100
  rep 83 of 100
  rep 84 of 100
  rep 85 of 100
  rep 86 of 100
  rep 87 of 100
  rep 88 of 100
  rep 89 of 100
  rep 90 of 100
  rep 91 of 100
  rep 92 of 100
  rep 93 of 100
  rep 94 of 100
  rep 95 of 100
  rep 96 of 100
  rep 97 of 100
  rep 98 of 100
  rep 99 of 100
  rep 100 of 100
sim 2 (reps: 50)
  rep 1 of 50
  rep 2 of 50
  rep 3 of 50
  rep 4 of 50
  rep 5 of 50
  rep 6 of 50
  rep 7 of 50
  rep 8 of 50
  rep 9 of 50
  rep 10 of 50
  rep 11 of 50
  rep 12 of 50
  rep 13 of 50
  rep 14 of 50
  rep 15 of 50
  rep 16 of 50
  rep 17 of 50
  rep 18 of 50
  rep 19 of 50
  rep 20 of 50
  rep 21 of 50
  rep 22 of 50
  rep 23 of 50
  rep 24 of 50
  rep 25 of 50
  rep 26 of 50
  rep 27 of 50
  rep 28 of 50
  rep 29 of 50
  rep 30 of 50
  rep 31 of 50
  rep 32 of 50
  rep 33 of 50
  rep 34 of 50
  rep 35 of 50
  rep 36 of 50
  rep 37 of 50
  rep 38 of 50
  rep 39 of 50
  rep 40 of 50
  rep 41 of 50
  rep 42 of 50
  rep 43 of 50
  rep 44 of 50
  rep 45 of 50
  rep 46 of 50
  rep 47 of 50
  rep 48 of 50
  rep 49 of 50
  rep 50 of 50
sim 3 (reps: 25)
  rep 1 of 25
  rep 2 of 25
  rep 3 of 25
  rep 4 of 25
  rep 5 of 25
  rep 6 of 25
  rep 7 of 25
  rep 8 of 25
  rep 9 of 25
  rep 10 of 25
  rep 11 of 25
  rep 12 of 25
  rep 13 of 25
  rep 14 of 25
  rep 15 of 25
  rep 16 of 25
  rep 17 of 25
  rep 18 of 25
  rep 19 of 25
  rep 20 of 25
  rep 21 of 25
  rep 22 of 25
  rep 23 of 25
  rep 24 of 25
  rep 25 of 25
sim 4 (reps: 20)
  rep 1 of 20
  rep 2 of 20
  rep 3 of 20
  rep 4 of 20
  rep 5 of 20
  rep 6 of 20
  rep 7 of 20
  rep 8 of 20
  rep 9 of 20
  rep 10 of 20
  rep 11 of 20
  rep 12 of 20
  rep 13 of 20
  rep 14 of 20
  rep 15 of 20
  rep 16 of 20
  rep 17 of 20
  rep 18 of 20
  rep 19 of 20
  rep 20 of 20
sim 5 (reps: 5)
  rep 1 of 5
  rep 2 of 5
  rep 3 of 5
  rep 4 of 5
  rep 5 of 5
sim 6 (reps: 5)
  rep 1 of 5
